tests/fixtures/webhooks/billing_statement.marked_uncollectible.json

{
    "id": "evt_ND27paq3da3wwFRSJitDu3uvtd6tZjZb",
    "resource": "event",
    "type": "billing_statement.marked_uncollectible",
    "data": {
        "id": "bstm_EzafBdpSQB1FHBWj3U4ZPZkVTfi2GfkJ",
        "resource": "billing_statement",
        "amount": 50000,
        "currency": "PHP",
        "customer_id": "cus_pwCPewCNMsmZu98woAtP5isdnL164Q7W",
        "description": "Updated description",
        "due_at": 1774402259,
        "finalized_at": 1773797474,
        "billing_statement_merchant_name": null,
        "billing_statement_number": "9FXNROGO-0001",
        "billing_statement_url": "https://bill.payrexhq.com/b/test_bstm_EzafBdpSQB1FHBWj3U4ZPZkVTfi2GfkJ_secret_HFy4TD9MXUVrsS8ZP8WUyJevHxUuRdQq6EJChJRezoxXabvhsZ",
        "line_items": [
            {
                "id": "bstm_li_rwv6dnECsEy5xdMdhAuhaaybmQSHG65q",
                "resource": "billing_statement_line_item",
                "description": "Line Item 1",
                "billing_statement_id": "bstm_EzafBdpSQB1FHBWj3U4ZPZkVTfi2GfkJ",
                "livemode": false,
                "quantity": 1,
                "unit_price": 50000,
                "created_at": 1773797434,
                "updated_at": 1773797434
            }
        ],
        "livemode": false,
        "merchant_id": "merc_XNNXbTz2n4UAigUwdPRdPqYUk61vvBDW",
        "statement_descriptor": null,
        "status": "uncollectible",
        "metadata": null,
        "customer": {
            "id": "cus_pwCPewCNMsmZu98woAtP5isdnL164Q7W",
            "name": "Test Customer",
            "email": "test@example.com"
        },
        "payment_intent": {
            "id": "pi_VTcMqhcsEFiAQQ6vBajbsyHXqXa8f2e2",
            "resource": "payment_intent",
            "amount": null,
            "amount_received": null,
            "amount_capturable": null,
            "client_secret": "pi_VTcMqhcsEFiAQQ6vBajbsyHXqXa8f2e2_secret_moary8CaUpuYpZYWx26NehQdJ3szwsJX",
            "currency": null,
            "description": null,
            "last_payment_error": null,
            "latest_payment": null,
            "livemode": false,
            "metadata": null,
            "payment_methods": null,
            "payment_method_id": null,
            "payment_method_options": null,
            "statement_descriptor": null,
            "status": "canceled",
            "next_action": null,
            "return_url": null,
            "created_at": 1773797474,
            "updated_at": 1773797556
        },
        "payment_settings": {
            "payment_methods": [
                "card"
            ]
        },
        "created_at": 1773797434,
        "updated_at": 1773797556
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {
        "status": "open"
    },
    "created_at": 1773797556,
    "updated_at": 1773797556
}
